%正向模型,多项式校正 
clc,clear all;
tic
img = imread('p13.bmp');
[m,n,cc] = size(img);%得到rgb图片的三个参数,长宽尺寸,与表征rgb的cc值3
k1 =0.49545%  0.36 ;
k2 =0.13888%  0.38 ;
k3 =0.02512%  2.3978e-011 ;
k4 =0.01087%  7.7897e-015;
k5 =0   % -1.3297e-016;
mm = m;
nn = n;
C = zeros(mm,nn,cc);%与原图像同样大小但没有像素值的0矩阵
i0 = 190;%图像中心坐标
j0 = 277;
di = 519;%每米象素的个数
dj = 530;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for i = 1:m
    for j = 1:n
        x = (i-i0)/di;
        y = (j-j0)/dj;
        r = x^2+y^2;
        u = i+(i-i0)*(k1*r+k2*r^2+k3*r^3+k4*r^4+k5*r^5);%鱼眼图像的校正模型,uv是校正后的像素坐标,ij是校正前的像素坐标
        v = j+(j-j0)*(k1*r+k2*r^2+k3*r^3+k4*r^4+k5*r^5);
        a = fix(u);%去整
        b = fix(v);
        if a>0 && b>0 && a <= m-1 && b<=n-1%逻辑与,4个条件均满足则执行下面的命令
        C(a,b,:) = img(i,j,:);%简单的邻域插值,其实不是插值算是填充吧,下面才是插值
        C(a+1,b,:) = img(i,j,:);
        C(a,b+1,:) = img(i,j,:);
        C(a+1,b+1,:) = img(i,j,:);
        end
    end
end
%%%%%%%%%%%%%%%%%%%%%简单的邻域插值%%%%%%%%%%%%%%%%%%%%%%%

toc
C = uint8(C);
imtool(C)
